// Напиши скрипт, який запитує у користувача вік (через prompt) і виводить у консоль:

// "Дитина" – якщо вік менше 12

// "Підліток" – якщо від 12 до 17

// "Дорослий" – якщо 18 і більше
function ageLook(age) {
  const age = Number(prompt("введіть вік"));
  if (age < 12) {
    console.loge("Дитина");
  } else if (age >= 12 && age <= 17) {
    console.loge("Підліток");
  } else age >= 18;
  {
    console.loge("Дорослий");
  }
}

// Завдання 2: Калькулятор з операторами

// Створи функцію calculate(a, b, operator), яка приймає два числа і рядок-оператор (+, -, *, /) і
// повертає результат обчислення. Якщо оператор невідомий – повертає "Невідомий оператор".

function calculate(a, b, operator) {
  switch (operator) {
    case "+":
      return a + b;
    case "-":
      return a - b;
    case "/":
      return a / b;
    case "*":
      return a * b;
    default:
      return;
      "Невідомий оператор";
  }
}

// Завдання 3: Зворотній відлік
// Напиши цикл for, який виводить числа від 10 до 1 у консоль, а після завершення – "Пуск!".

for (let index = 10; index < 1; index--) {
  console.log(i);
}
console.log("Пуск!");

// Завдання 4: Підрахунок парних чисел

// Створи цикл for, який проходить числа від 1 до 20 і виводить тільки парні числа у консоль.

for (let index = 1; index <= 20; index++) {
  if (index % 2 === 0) {
    console.log(i);
  }
}
// Завдання 5: Таблиця множення

// Напиши цикл for, який виводить у консоль таблицю множення числа 7 (від 1 до 10), у форматі:
const number = 7;

for (let i = 1; i <= 10; i++) {
  console.log(`${number} x ${i} = ${number * i}`);
}
