// Задача 1 — Обчислення площі прямокутника
// const width = 10;
// const height = 5;
// const area = width * height;
// console.log(area);

// 🧠 Задача 1: Обчисли площу трикутника

// Створи змінні base і height, обчисли площу трикутника за формулою

// площа = (base * height) / 2
// і виведи результат у консоль.

// const base = 10;
// const height = 6;
function ereaTriangle(base, height) {
  return (base * height) / 2;
}
console.log(ereaTriangle(10, 6));
console.log(ereaTriangle(9, 5));
console.log(ereaTriangle(46, 60));

// 🧠 Задача 2: Вартість пального

// Користувач купує бензин по 58 грн за літр.
// Створи змінні pricePerLiter і liters, обчисли totalPrice і виведи рядок:

// “Total cost for 25 liters is 1450 UAH”

function totalCost(pricePerLiter, liter) {
  return `Total cost for ${liter} liters is ${pricePerLiter * liter} UAH`;
}

console.log(totalCost(58, 25));

// Є змінні firstName і lastName.
// Виведи повідомлення:

// “Hello, [ім’я] [прізвище]! Welcome to GoIT!”

function greeting(name, secondName) {
  return `Hello ${name} ${secondName}! Welcome to GoIT!`;
}
console.log(greeting("Andrii", "Ternenko"));

// 🧠 Задача 4: Підрахунок балів

// Гравець отримав певну кількість очок за три рівні.
// Обчисли суму і середнє значення балів.

// const level1 = 80;
// const level2 = 95;
// const level3 = 70;

// Виведи в консоль:

// “Total: 245, Average: 81.67”

function totalPoints(level1, level2, level3) {
  return ((level1 + level2 + level3) / arguments.length).toFixed(3);
}
console.log(totalPoints(80, 95, 70));

// 🧠 Задача 5: Знижка
// Магазин дає 10% знижку на товар.
// Обчисли кінцеву ціну після знижки.

// const price = 1200;
// const discount = 10; // %

// Результат:

// “Final price: 1080 UAH”

function finalPrice(price, discount) {
  return price - (price / 100) * discount;
}
console.log(finalPrice(1200, 10));


// ⚙️ Задача 6: Перевірка доступу

// Напиши код, який перевіряє, чи користувач має доступ до сайту.
// Доступ дозволено лише, якщо age >= 18.

// const age = 16;


// → “Access denied”
// → “Access granted”

// ⚙️ Задача 7: Обчисли решту

// Користувач заплатив певну суму, а товар коштує дешевше.
// Обчисли і виведи решту або повідомлення, якщо грошей не вистачає.

// const productPrice = 450;
// const userMoney = 500;


// → “Your change is 50 UAH”
// → або “Not enough money”

// ⚙️ Задача 8: Визначення сезону

// Користувач вводить номер місяця (1–12).
// Поверни назву сезону:

// Місяці	Сезон
// 12, 1, 2	Зима
// 3, 4, 5	Весна
// 6, 7, 8	Літо
// 9, 10, 11	Осінь

// Використай switch.

// ⚙️ Задача 9: Авторизація користувача

// Створи константу ADMIN_PASSWORD = "qwerty".
// Користувач вводить пароль (змінна password).
// Виведи:

// “Welcome!” якщо пароль правильний

// “Canceled” якщо password === null

// “Access denied” інакше

// ⚙️ Задача 10: Перевірка діапазону

// Створи функцію isNumberInRange(start, end, number)
// Поверни true, якщо число входить у проміжок [start, end], і false — якщо ні.

// isNumberInRange(10, 20, 15); // true
// isNumberInRange(10, 20, 25); // false


// Хочеш, я зроблю варіант цих задач з автоматичними тестами (як у GoIT — коли одразу показує “✅ пройдено / ❌ помилка”)?
// Тоді зможеш тренуватися прямо в браузері або в VS Code.